1. Add, subtract, multiple and divide two series of Pandas.

Series1: [2, 4, 6, 8, 10]
series2: [1,2,3,4,5]

In [3]:
import pandas as pd

In [5]:
s1 = pd.Series([2, 4, 6, 8, 10])
s2 = pd.Series([1,2,3,4,5])

print(s1+s2)
print(s1-2)
print(s1*2)
print(s1/s2)

0     3
1     6
2     9
3    12
4    15
dtype: int64
0    0
1    2
2    4
3    6
4    8
dtype: int64
0     4
1     8
2    12
3    16
4    20
dtype: int64
0    2.0
1    2.0
2    2.0
3    2.0
4    2.0
dtype: float64

In [ ]:
2.  compare the elements of the two Pandas Series.

Series1: [2, 4, 6, 8, 10]
series2: [1,2,3,4,5]

In [3]:
s1 = pd.Series([2, 4, 6, 8, 10])
s2 = pd.Series([1,2,3,4,5])

s1==s2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [ ]:
3.convert a dictionary to a Pandas series.
Sample dictionary: d1 = {'A': 5, 'B': 10, 'C':15, 'D':20, 'E':25}

In [5]:
d = {'A': 5, 'B': 10, 'C':15, 'D':20, 'E':25}
print(d)
series = pd.Series(d)
series

{'A': 5, 'B': 10, 'C': 15, 'D': 20, 'E': 25}

A     5
B    10
C    15
D    20
E    25
dtype: int64

In [ ]:
4.  convert a NumPy array to a Pandas series.


Sample NumPy array: d1 = [10,15,20,25,30]

In [6]:
import numpy as np

np_array = np.array([10,15,20,25,30])
print(np_array)

series = pd.Series(np_array)
series

[10 15 20 25 30]

0    10
1    15
2    20
3    25
4    30
dtype: int32

In [ ]:
5. create a sereis then  add some data to an existing Series.

In [ ]:
*hint S.append()

In [ ]:
6. Find the mean and standard deviation of a given Series. 

series = [1,2,2,3,4,6,5,7,8,4,2,3,6,8,9,8]

In [7]:
import pandas as pd
s = pd.Series(data = [1,2,2,3,4,6,5,7,8,4,2,3,6,8,9,8])

print(s.mean())
print(s.std())

4.875
2.6044833140823407

In [ ]:
7.  create and display a DataFrame from a specified dictionary data which has the index labels.

DataFrame:
    
student  = {'Name': ['smith', 'dona', 'Katherine', 'john', 'roman', 'ross', 'Matthew', 'joey', 'monica', 'rachel'],
'Grade': [9, 9, 8.3, 7.3, 4, 5, 6.5, 7.9, 7.5, 8.5],
'Country': ['USA', 'USA', 'AUS', 'USA', 'AUS', 'USA', 'Can', 'AUS', 'Can', 'yes'],
'eligibility': ['eligible', 'eligible', 'Not eligible', 'Not eligible', 'eligible','eligible', 'eligible', 'eligible', 'Not eligible', 'Not eligible']          
           }
labels = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [30]:
import pandas as pd
import numpy as np

student  = {'Name': ['smith', 'dona', 'Katherine', 'john', 'roman', 'ross', 'Matthew', 'joey', 'monica', 'rachel'],
'Grade': [9, 9, 8.3, 7.3, 4, 5, 6.5, 7.9, 7.5, 8.5],
'Country': ['USA', 'USA', 'AUS', 'USA', 'AUS', 'USA', 'Can', 'AUS', 'Can', 'yes'],
'eligibility': ['eligible', 'eligible', 'Not eligible', 'Not eligible', 'eligible','eligible', 'eligible', 'eligible', 'Not eligible', 'Not eligible']          
           }
labels = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

df = pd.DataFrame(student , index=labels)
print(df)

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
D       john    7.3     USA  Not eligible
E      roman    4.0     AUS      eligible
F       ross    5.0     USA      eligible
G    Matthew    6.5     Can      eligible
H       joey    7.9     AUS      eligible
I     monica    7.5     Can  Not eligible
J     rachel    8.5     yes  Not eligible

In [ ]:
8.  select the 'name' and 'Grade' columns from Student dataframe (Q.7 dataframe)

In [23]:
print(df[['Name', 'Grade']])

        Name  Grade
A      smith    9.0
B       dona    9.0
C  Katherine    8.3
D       john    7.3
E      roman    4.0
F       ross    5.0
G    Matthew    6.5
H       joey    7.9
I     monica    7.5
J     rachel    8.5

In [ ]:
9. get the first 3 rows from Student dataframe (Q.7 dataframe)

In [24]:

print(df.iloc[:3])

        Name  Grade Country eligibility
A      smith    9.0     USA         yes
B       dona    9.0     USA         yes
C  Katherine    8.3     AUS         yes

In [ ]:
10.select the rows where the number of Grade is greater than 8 from Student dataframe (Q.7 dataframe)

In [31]:


print(df[df['Grade'] > 8])

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
J     rachel    8.5     yes  Not eligible

In [ ]:
11. change the Grade in row D to 8.6. from Student dataframe (Q.7 dataframe)

In [32]:

df.loc['D', 'Grade'] = 8.6
print(df)

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
D       john    8.6     USA  Not eligible
E      roman    4.0     AUS      eligible
F       ross    5.0     USA      eligible
G    Matthew    6.5     Can      eligible
H       joey    7.9     AUS      eligible
I     monica    7.5     Can  Not eligible
J     rachel    8.5     yes  Not eligible

In [ ]:
12. calculate the sum of Grade by the students. from Student dataframe (Q.7 dataframe)

In [27]:

print(df['Grade'].sum())

74.3

In [ ]:
13.  calculate the mean Grade for each different student in data frame.

In [28]:

print(df['Grade'].mean())

7.43

In [ ]:
14.  sort the data frame first by 'Name' in descending order, then by 'Grade' in ascending order.

In [33]:

df.sort_values(by=['Name', 'Grade'], ascending=[False, True])
print(df)

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
D       john    8.6     USA  Not eligible
E      roman    4.0     AUS      eligible
F       ross    5.0     USA      eligible
G    Matthew    6.5     Can      eligible
H       joey    7.9     AUS      eligible
I     monica    7.5     Can  Not eligible
J     rachel    8.5     yes  Not eligible

In [ ]:
15.replace the eligibility column contains the values 'eligibility' and 'Not eligible' with YES and NO.

In [34]:

df['eligibility'] = df['eligibility'].map({'eligible': 'YES', 'Not eligible': 'NO'})
print(df)

        Name  Grade Country eligibility
A      smith    9.0     USA         YES
B       dona    9.0     USA         YES
C  Katherine    8.3     AUS          NO
D       john    8.6     USA          NO
E      roman    4.0     AUS         YES
F       ross    5.0     USA         YES
G    Matthew    6.5     Can         YES
H       joey    7.9     AUS         YES
I     monica    7.5     Can          NO
J     rachel    8.5     yes          NO

In [ ]:
16. join the two given dataframes along rows and assign all data.

Test Data:

emp_1:
  emp_id     name           Salary
0   1        Same            13222
1   2        Ross            10300
2   3        Mike            19000
3   4        Roman           22332
4   5        Smith           19900


emp_2:
  emp_id    name          Salary
0    6      Scarlette     12201
1    7      Williamson    23200
2    8      Morse         13198
3    9      Kaiser        11219
4    10     Preston       10201

In [39]:

emp_1 = pd.DataFrame({
        'emp_id': [1, 2, 3, 4, 5],
         'name': ['Same','Ross', 'Mike','Roman','Smith',], 
        'Salary': [13222, 10300, 19000, 22332, 19900]})

emp_2 = pd.DataFrame({
        'emp_id': [6,7,8,9,10],
        'name': ['Scarlette', 'Williamson', 'Morse', 'Kaiser', 'Preston'], 
        'Salary': [12201, 23200, 13198, 11219, 10201]})

print("Original Data")
print(emp_1)
print("-------------------------------------")
print(emp_2)
print("\nJoin two dataframes along rows:")
result_data = pd.concat([emp_1, emp_2])
print(result_data)

Original Data
   emp_id   name  Salary
0       1   Same   13222
1       2   Ross   10300
2       3   Mike   19000
3       4  Roman   22332
4       5  Smith   19900
-------------------------------------
   emp_id        name  Salary
0       6   Scarlette   12201
1       7  Williamson   23200
2       8       Morse   13198
3       9      Kaiser   11219
4      10     Preston   10201

Join two dataframes along rows:
   emp_id        name  Salary
0       1        Same   13222
1       2        Ross   10300
2       3        Mike   19000
3       4       Roman   22332
4       5       Smith   19900
0       6   Scarlette   12201
1       7  Williamson   23200
2       8       Morse   13198
3       9      Kaiser   11219
4      10     Preston   10201

In [ ]:
17. Write a Pandas program to append given rows to an existing DataFrame emp_1 and display the combined data.

data:
emp_id                  12
name                   mike
Salary                 349985

In [50]:
s = pd.Series(['12', 'Mike', 349985], index=['emp_id', 'name', 'Salary'])
combined_data =  emp_1.append(s, ignore_index=True, sort=False)
combined_data

  emp_id   name  Salary
0      1   Same   13222
1      2   Ross   10300
2      3   Mike   19000
3      4  Roman   22332
4      5  Smith   19900
5     12   Mike  349985

In [ ]:
18. Write a Pandas program to append a list of dictioneries  existing DataFrame Emp_2 and display the combined data.


Dictionary:

emp_id                  11
name                   Luis
Salary                 22356

In [54]:


dicts = [{'emp_id': 11, 'name': 'Luis', 'Salary': 22356},
         ]

print(emp_2)
combined_data =  emp_2.append(dicts, ignore_index=True, sort=False)
combined_data

   emp_id        name  Salary
0       6   Scarlette   12201
1       7  Williamson   23200
2       8       Morse   13198
3       9      Kaiser   11219
4      10     Preston   10201

   emp_id        name  Salary
0       6   Scarlette   12201
1       7  Williamson   23200
2       8       Morse   13198
3       9      Kaiser   11219
4      10     Preston   10201
5      11        Luis   22356

In [ ]:
19. Write a Pandas program to join the two dataframes using the common column of both dataframes.


emp_1:
  emp_id     name           Salary
0   1        Same            13222
1   2        Ross            10300
2   3        Mike            19000
3   4        Roman           22332
4   5        Smith           19900


emp_2:
  emp_id    name          Salary
0    4      Scarlette     12201
1    5      Williamson    23200
2    8      Morse         13198
3    9      Kaiser        11219
4    10     Preston       10201

In [60]:
emp_1 = pd.DataFrame({
        'emp_id': [1, 2, 3, 4, 5],
         'name': ['Same','Ross', 'Mike','Roman','Smith',], 
        'Salary': [13222, 10300, 19000, 22332, 19900]})

emp_2 = pd.DataFrame({
        'emp_id': [4,5,8,9,10],
        'name': ['Scarlette', 'Williamson', 'Morse', 'Kaiser', 'Preston'], 
        'Salary': [12201, 23200, 13198, 11219, 10201]})


merged_data = pd.merge(emp_1, emp_2, on='emp_id', how='inner')
merged_data

   emp_id name_x  Salary_x      name_y  Salary_y
0       4  Roman     22332   Scarlette     12201
1       5  Smith     19900  Williamson     23200

In [ ]:
20. Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

Data:
    
df1: 
Year    Week    Colour    Val1 
2020       A       Red      50
2020       B       Red      60
2020       B     Black      70
2020       C       Red      10
2020       D     Green      20

df2:
Year    Week    Colour    Val2
2020       A     Black      30
2020       B     Black     100
2020       C     Green      50
2020       C       Red      20
2020       D       Red      40

In [68]:
data1 = pd.DataFrame({'Year': [2020,2020,2020,2020,2020],
                     'Week': ['A', 'B', 'B', 'C','D'],
                     'Colour': ['Red', 'Red', 'Black', 'Red','Green'],
                     'Val1': [50,60,70,10,20]}) 

data2 = pd.DataFrame({'Year': [2020,2020,2020,2020,2020],
                     'Week': ['A', 'B', 'C', 'C','D'],
                     'Colour': ['Black', 'Black', 'Green', 'Red','Red'],
                     'Val1': [30,100,50,20,40]}) 


print("Original DataFrames:")
print(data1)
print("--------------------")
print(data2)

merged_data = pd.merge(data1, data2, how='left', on=['Week', 'Colour'])
print(merged_data)

Original DataFrames:
   Year Week Colour  Val1
0  2020    A    Red    50
1  2020    B    Red    60
2  2020    B  Black    70
3  2020    C    Red    10
4  2020    D  Green    20
--------------------
   Year Week Colour  Val1
0  2020    A  Black    30
1  2020    B  Black   100
2  2020    C  Green    50
3  2020    C    Red    20
4  2020    D    Red    40
   Year_x Week Colour  Val1_x  Year_y  Val1_y
0    2020    A    Red      50     NaN     NaN
1    2020    B    Red      60     NaN     NaN
2    2020    B  Black      70  2020.0   100.0
3    2020    C    Red      10  2020.0    20.0
4    2020    D  Green      20     NaN     NaN